{
  "animals": [
    {
      "id": 1,
      "name": "Fox",
      "aclass": "mammals",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/c/c8/R%C3%A4v_vid_Revhusen_i_Ystad_-_Juli_2012..jpg/220px-R%C3%A4v_vid_Revhusen_i_Ystad_-_Juli_2012..jpg",
      "desc": "Foxes are small to medium-sized, omnivorous mammals belonging to several genera of the family Canidae. Foxes have a flattened skull, upright triangular ears, a pointed, slightly upturned snout, and a long bushy tail (or brush).",
      "link": "https://en.wikipedia.org/wiki/Fox"
    },
    {
      "name": "Wolf",
      "aclass": "mammals",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/5/5f/Kolm%C3%A5rden_Wolf.jpg/440px-Kolm%C3%A5rden_Wolf.jpg",
      "desc": "The wolf (Canis lupus[a]), also known as the gray wolf or grey wolf, is a large canine native to Eurasia and North America. More than thirty subspecies of Canis lupus have been recognized, and gray wolves, as colloquially understood, comprise non-domestic/feral subspecies. The wolf is the largest extant member of Canidae, males averaging 40 kg (88 lb) and females 37 kg (82 lb). Wolves measure 105–160 cm (41–63 in) in length and 80–85 cm (31–33 in) at shoulder height. The wolf is also distinguished from other Canis species by its less pointed ears and muzzle, as well as a shorter torso and a longer tail. The wolf is nonetheless related closely enough to smaller Canis species, such as the coyote and the golden jackal, to produce fertile hybrids with them. The banded fur of a wolf is usually mottled white, brown, gray, and black, although subspecies in the arctic region may be nearly all white.",
      "link": "https://en.wikipedia.org/wiki/Wolf",
      "id": 2
    },
    {
      "name": "Swallow",
      "aclass": "birds",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/2/2f/Pied-winged_swallow_%28Hirundo_leucosoma%29.jpg/440px-Pied-winged_swallow_%28Hirundo_leucosoma%29.jpg",
      "desc": "The swallows, martins, and saw-wings, or Hirundinidae, are a family of passerine birds found around the world on all continents, including occasionally in Antarctica. Highly adapted to aerial feeding, they have a distinctive appearance. The term \"swallow\" is used colloquially in Europe as a synonym for the barn swallow. Around 90 species of Hirundinidae are known,[1] divided into 19 genera, with the greatest diversity found in Africa, which is also thought to be where they evolved as hole-nesters.[2] They also occur on a number of oceanic islands. A number of European and North American species are long-distance migrants; by contrast, the West and South African swallows are nonmigratory.",
      "link": "https://en.wikipedia.org/wiki/Swallow",
      "id": 3
    },
    {
      "name": "Rabbit",
      "aclass": "mammals",
      "img": "https://upload.wikimedia.org/wikipedia/commons/thumb/1/1f/Oryctolagus_cuniculus_Rcdo.jpg/440px-Oryctolagus_cuniculus_Rcdo.jpg",
      "desc": "Rabbits are small mammals in the family Leporidae of the order Lagomorpha (along with the hare and the pika). Oryctolagus cuniculus includes the European rabbit species and its descendants, the world's 305 breeds[1] of domestic rabbit. Sylvilagus includes 13 wild rabbit species, among them the seven types of cottontail. The European rabbit, which has been introduced on every continent except Antarctica, is familiar throughout the world as a wild prey animal and as a domesticated form of livestock and pet. With its widespread effect on ecologies and cultures, the rabbit (or bunny) is, in many areas of the world, a part of daily life—as food, clothing, a companion, and a source of artistic inspiration.",
      "link": "https://en.wikipedia.org/wiki/Rabbit",
      "id": 4
    },
    {
      "name": "Cat",
      "aclass": "",
      "img": "https://source.unsplash.com/1600x900/?cat",
      "desc": "The cat (Felis catus) is a domestic species of small carnivorous mammal.[1][2] It is the only domesticated species in the family Felidae and is often referred to as the domestic cat to distinguish it from the wild members of the family.[4] A cat can either be a house cat, a farm cat or a feral cat; the latter ranges freely and avoids human contact.[5] Domestic cats are valued by humans for companionship and their ability to hunt rodents. About 60 cat breeds are recognized by various cat registries.[6]\n\nThe cat is similar in anatomy to the other felid species: it has a strong flexible body, quick reflexes, sharp teeth and retractable claws adapted to killing small prey. Its night vision and sense of smell are well developed. Cat communication includes vocalizations like meowing, purring, trilling, hissing, growling and grunting as well as cat-specific body language. A predator that is most active at dawn and dusk, the cat is a solitary hunter but a social species. It can hear sounds too faint or too high in frequency for human ears, such as those made by mice and other small mammals.[7] It secretes and perceives pheromones.[8]",
      "link": "https://en.wikipedia.org/wiki/Cat",
      "id": 5
    },
    {
      "name": "Dog",
      "aclass": "",
      "img": "https://source.unsplash.com/1600x900/?dog",
      "desc": "The domestic dog (Canis familiaris or Canis lupus familiaris)[4] is a domesticated wolf. The dog descended from an ancient, extinct wolf,[5][6] with the modern grey wolf being the dog's nearest living relative.[7] The dog was the first species to be domesticated[8][7] by hunter–gatherers over 15,000 years ago,[6] before the development of agriculture.[1] Their long association with humans has led dogs to be uniquely adapted to human behavior,[9] leading to a large number of domestic individuals[10] and the ability to thrive on a starch-rich diet that would be inadequate for other canids.[11]\n\nThe dog has been selectively bred over millennia for various behaviors, sensory capabilities, and physical attributes.[12] Dogs are subclassified into breeds, which vary widely in shape, size, and color.[13] They perform many roles for humans, such as hunting, herding, pulling loads, protection, assisting police and the military, companionship, therapy, and aiding disabled people. This influence on human society has given them the sobriquet of \"man's best friend.\"",
      "link": "https://en.wikipedia.org/wiki/Dog",
      "id": 6
    },
    {
      "name": "Raven",
      "aclass": "birds",
      "img": "https://source.unsplash.com/1600x900/?raven",
      "desc": "A raven is one of several larger-bodied species of the genus Corvus. These species do not form a single taxonomic group within the genus.\n\nThere is no consistent distinction between \"crows\" and \"ravens\", and these appellations have been assigned to different species chiefly on the basis of their size, crows generally being smaller than ravens.\n\nThe largest raven species are the common raven and the thick-billed raven.",
      "link": "https://en.wikipedia.org/wiki/Raven",
      "id": 7
    },
    {
      "name": "Elephant",
      "aclass": "mammals",
      "img": "https://source.unsplash.com/1600x900/?elephant",
      "desc": "Elephants are the largest existing land animals. Three species are currently recognised: the African bush elephant, the African forest elephant, and the Asian elephant. Elephantidae is the only surviving family of the order Proboscidea; extinct members include the mastodons. The family Elephantidae also contains several extinct groups, including the mammoths and straight-tusked elephants. African elephants have larger ears and concave backs, whereas Asian elephants have smaller ears, and convex or level backs. Distinctive features of all elephants include a long proboscis called a trunk, tusks, large ear flaps, massive legs, and tough but sensitive skin. The trunk is used for breathing, bringing food and water to the mouth, and grasping objects. Tusks, which are derived from the incisor teeth, serve both as weapons and as tools for moving objects and digging. The large ear flaps assist in maintaining a constant body temperature as well as in communication. The pillar-like legs carry their great weight.",
      "link": "https://en.wikipedia.org/wiki/Elephant",
      "id": 8
    },
    {
      "name": "Alligator",
      "aclass": "reptiles",
      "img": "https://source.unsplash.com/1600x900/?alligator",
      "desc": "An alligator is a crocodilian in the genus Alligator of the family Alligatoridae. The two extant species are the American alligator (A. mississippiensis) and the Chinese alligator (A. sinensis). Additionally, several extinct species of alligator are known from fossil remains. Alligators first appeared during the Oligocene epoch about 37 million years ago.[1]\n\nThe name \"alligator\" is probably an anglicized form of el lagarto, the Spanish term for \"the lizard\", which early Spanish explorers and settlers in Florida called the alligator.[2] Later English spellings of the name included allagarta and alagarto.[3]",
      "link": "https://en.wikipedia.org/wiki/Alligator",
      "id": 9
    },
    {
      "name": "test",
      "aclass": "birds",
      "img": "https://source.unsplash.com/1600x900/?bird",
      "desc": "jaldfhldfhn",
      "link": "https://en.wikipedia.org/wiki/Bird",
      "id": 10
    }
  ]
}